Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: ووهبنا له إسحاق ويعقوب وجعلنا في ذريته النبوة والكتاب وآتيناه أجره في الدنيا وإنه في الآخرة لمن الصالحين
en: And We gave to Him Isaac and Jacob and placed in his descendants prophethood and scripture. And We gave him his reward in this world, and indeed, he is in the Hereafter among the righteous.

source: ولوطا إذ قال لقومه إنكم لتأتون الفاحشة ما سبقكم بها من أحد من العالمين
en: And [mention] Lot, when he said to his people, "Indeed, you commit such immorality as no one has preceded you with from among the worlds.

source: أئنكم لتأتون الرجال وتقطعون السبيل وتأتون في ناديكم المنكر فما كان جواب قومه إلا أن قالوا ائتنا بعذاب الله إن كنت من الصادقين
en: Indeed, you approach men and obstruct the road and commit in your meetings [every] evil." And the answer of his people was not but they said, "Bring us the punishment of Allah, if you should be of the truthful."

source: قال رب انصرني على القوم المفسدين
en: He said, "My Lord, support me against the corrupting people."

source: ولما جاءت رسلنا إبراهيم بالبشرى قالوا إنا مهلكو أهل هذه القرية إن أهلها كانوا ظالمين
en: And when Our messengers came to Abraham with the good tidings, they said, "Indeed, we will destroy the people of that Lot's city. Indeed, its people have been wrongdoers."

source: قال إن فيها لوطا قالوا نحن أعلم بمن فيها لننجينه وأهله إلا امرأته كانت من الغابرين
en: [Abraham] said, "Indeed, within it is Lot." They said, "We are more knowing of who is within it. We will surely save him and his family, except his wife. She is to be of those who remain behind."

source: ولما أن جاءت رسلنا لوطا سيء بهم وضاق بهم ذرعا وقالوا لا تخف ولا تحزن إنا منجوك وأهلك إلا امرأتك كانت من الغابرين
en: And when Our messengers came to Lot, he was distressed for them and felt for them great discomfort. They said, "Fear not, nor grieve. Indeed, we will save you and your family, except your wife; she is to be of those who remain behind.

source: إنا منزلون على أهل هذه القرية رجزا من السماء بما كانوا يفسقون
en: Indeed, we will bring down on the people of this city punishment from the sky because they have been defiantly disobedient."

source: ولقد تركنا منها آية بينة لقوم يعقلون
en: And We have certainly left of it a sign as clear evidence for a people who use reason.

source: وإلى مدين أخاهم شعيبا فقال يا قوم اعبدوا الله وارجوا اليوم الآخر ولا تعثوا في الأرض مفسدين
en: And to Madyan [We sent] their brother Shu'ayb, and he said, "O my people, worship Allah and expect the Last Day and do not commit abuse on the earth, spreading corruption."

source: فكذبوه فأخذتهم الرجفة فأصبحوا في دارهم جاثمين
en: But they denied him, so the earthquake seized them, and they became within their home [corpses] fallen prone.

source: وعادا وثمود وقد تبين لكم من مساكنهم وزين لهم الشيطان أعمالهم فصدهم عن السبيل وكانوا مستبصرين
en: And [We destroyed] 'Aad and Thamud, and it has become clear to you from their [ruined] dwellings. And Satan had made pleasing to them their deeds and averted them from the path, and they were endowed with perception.

source: وقارون وفرعون وهامان ولقد جاءهم موسى بالبينات فاستكبروا في الأرض وما كانوا سابقين
en: And [We destroyed] Qarun and Pharaoh and Haman. And Moses had already come to them with clear evidences, and they were arrogant in the land, but they were not outrunners [of Our punishment].

source: فكلا أخذنا بذنبه فمنهم من أرسلنا عليه حاصبا ومنهم من أخذته الصيحة ومنهم من خسفنا به الأرض ومنهم من أغرقنا وما كان الله ليظلمهم ولكن كانوا أنفسهم يظلمون
en: So each We seized for his sin; and among them were those upon whom We sent a storm of stones, and among them were those who were seized by the blast [from the sky], and among them were those whom We caused the earth to swallow, and among them were those whom We drowned. And Allah would not have wronged them, but it was they who were wronging themselves.

source: مثل الذين اتخذوا من دون الله أولياء كمثل العنكبوت اتخذت بيتا وإن أوهن البيوت لبيت العنكبوت لو كانوا يعلمون
en: The example of those who take allies other than Allah is like that of the spider who takes a home. And indeed, the weakest of homes is the home of the spider, if they only knew.

source: إن الله يعلم ما يدعون من دونه من شيء وهو العزيز الحكيم
en: Indeed, Allah knows whatever thing they call upon other than Him. And He is the Exalted in Might, the Wise.

source: وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون
en: And these examples We present to the people, but none will understand them except those of knowledge.

source: خلق الله السماوات والأرض بالحق إن في ذلك لآية للمؤمنين
en: Allah created the heavens and the earth in truth. Indeed in that is a sign for the believers.

source: اتل ما أوحي إليك من الكتاب وأقم الصلاة إن الصلاة تنهى عن الفحشاء والمنكر ولذكر الله أكبر والله يعلم ما تصنعون
en: Recite, [O Muhammad], what has been revealed to you of the Book and establish prayer. Indeed, prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater. And Allah knows that which you do.

source: ولا تجادلوا أهل الكتاب إلا بالتي هي أحسن إلا الذين ظلموا منهم وقولوا آمنا بالذي أنزل إلينا وأنزل إليكم وإلهنا وإلهكم واحد ونحن له مسلمون
en: And do not argue with the People of the Scripture except in a way that is best, except for those who commit injustice among them, and say, "We believe in that which has been revealed to us and revealed to you. And our God and your God is one; and we are Muslims [in submission] to Him."

source: وكذلك أنزلنا إليك الكتاب فالذين آتيناهم الكتاب يؤمنون به ومن هؤلاء من يؤمن به وما يجحد بآياتنا إلا الكافرون
en: And thus We have sent down to you the Qur'an. And those to whom We [previously] gave the Scripture believe in it. And among these [people of Makkah] are those who believe in it. And none reject Our verses except the disbelievers.

source: وما كنت تتلو من قبله من كتاب ولا تخطه بيمينك إذا لارتاب المبطلون
en: And you did not recite before it any scripture, nor did you inscribe one with your right hand. Otherwise the falsifiers would have had [cause for] doubt.

source: بل هو آيات بينات في صدور الذين أوتوا العلم وما يجحد بآياتنا إلا الظالمون
en: Rather, the Qur'an is distinct verses [preserved] within the breasts of those who have been given knowledge. And none reject Our verses except the wrongdoers.

source: وقالوا لولا أنزل عليه آيات من ربه قل إنما الآيات عند الله وإنما أنا نذير مبين
en: But they say, "Why are not signs sent down to him from his Lord?" Say, "The signs are only with Allah, and I am only a clear warner."

source: أولم يكفهم أنا أنزلنا عليك الكتاب يتلى عليهم إن في ذلك لرحمة وذكرى لقوم يؤمنون
en: And is it not sufficient for them that We revealed to you the Book which is recited to them? Indeed in that is a mercy and reminder for a people who believe.

source: قل كفى بالله بيني وبينكم شهيدا يعلم ما في السماوات والأرض والذين آمنوا بالباطل وكفروا بالله أولئك هم الخاسرون
en: Say, "Sufficient is Allah between me and you as Witness. He knows what is in the heavens and earth. And they who have believed in falsehood and disbelieved in Allah - it is those who are the losers."

source: ويستعجلونك بالعذاب ولولا أجل مسمى لجاءهم العذاب وليأتينهم بغتة وهم لا يشعرون
en: And they urge you to hasten the punishment. And if not for [the decree of] a specified term, punishment would have reached them. But it will surely come to them suddenly while they perceive not.

source: يستعجلونك بالعذاب وإن جهنم لمحيطة بالكافرين
en: They urge you to hasten the punishment. And indeed, Hell will be encompassing of the disbelievers

source: يوم يغشاهم العذاب من فوقهم ومن تحت أرجلهم ويقول ذوقوا ما كنتم تعملون
en: On the Day the punishment will cover them from above them and from below their feet and it is said, "Taste [the result of] what you used to do."

source: يا عبادي الذين آمنوا إن أرضي واسعة فإياي فاعبدون
en: O My servants who have believed, indeed My earth is spacious, so worship only Me.

source: كل نفس ذائقة الموت ثم إلينا ترجعون
en: Every soul will taste death. Then to Us will you be returned.

source: والذين آمنوا وعملوا الصالحات لنبوئنهم من الجنة غرفا تجري من تحتها الأنهار خالدين فيها نعم أجر العاملين
en: And those who have believed and done righteous deeds - We will surely assign to them of Paradise [elevated] chambers beneath which rivers flow, wherein they abide eternally. Excellent is the reward of the [righteous] workers

source: وكأين من دابة لا تحمل رزقها الله يرزقها وإياكم وهو السميع العليم
en: And how many a creature carries not its [own] provision. Allah provides for it and for you. And He is the Hearing, the Knowing.

source: ولئن سألتهم من خلق السماوات والأرض وسخر الشمس والقمر ليقولن الله فأنى يؤفكون
en: If you asked them, "Who created the heavens and earth and subjected the sun and the moon?" they would surely say, "Allah." Then how are they deluded?

source: الله يبسط الرزق لمن يشاء من عباده ويقدر له إن الله بكل شيء عليم
en: Allah extends provision for whom He wills of His servants and restricts for him. Indeed Allah is, of all things, Knowing.

source: ولئن سألتهم من نزل من السماء ماء فأحيا به الأرض من بعد موتها ليقولن الله قل الحمد لله بل أكثرهم لا يعقلون
en: And if you asked them, "Who sends down rain from the sky and gives life thereby to the earth after its lifelessness?" they would surely say " Allah." Say, "Praise to Allah "; but most of them do not reason.

source: وما هذه الحياة الدنيا إلا لهو ولعب وإن الدار الآخرة لهي الحيوان لو كانوا يعلمون
en: And this worldly life is not but diversion and amusement. And indeed, the home of the Hereafter - that is the [eternal] life, if only they knew.

source: فإذا ركبوا في الفلك دعوا الله مخلصين له الدين فلما نجاهم إلى البر إذا هم يشركون
en: And when they board a ship, they supplicate Allah, sincere to Him in religion. But when He delivers them to the land, at once they associate others with Him

source: ليكفروا بما آتيناهم وليتمتعوا فسوف يعلمون
en: So that they will deny what We have granted them, and they will enjoy themselves. But they are going to know.

source: أولم يروا أنا جعلنا حرما آمنا ويتخطف الناس من حولهم أفبالباطل يؤمنون وبنعمة الله يكفرون
en: Have they not seen that We made [Makkah] a safe sanctuary, while people are being taken away all around them? Then in falsehood do they believe, and in the favor of Allah they disbelieve?

source: ومن أظلم ممن افترى على الله كذبا أو كذب بالحق لما جاءه أليس في جهنم مثوى للكافرين
en: And who is more unjust than one who invents a lie about Allah or denies the truth when it has come to him? Is there not in Hell a [sufficient] residence for the disbelievers?

source: والذين جاهدوا فينا لنهدينهم سبلنا وإن الله لمع المحسنين
en: And those who strive for Us - We will surely guide them to Our ways. And indeed, Allah is with the doers of good.

source: غلبت الروم
en: The Byzantines have been defeated

source: في أدنى الأرض وهم من بعد غلبهم سيغلبون
en: In the nearest land. But they, after their defeat, will overcome.

source: في بضع سنين لله الأمر من قبل ومن بعد ويومئذ يفرح المؤمنون
en: Within three to nine years. To Allah belongs the command before and after. And that day the believers will rejoice

source: بنصر الله ينصر من يشاء وهو العزيز الرحيم
en: In the victory of Allah. He gives victory to whom He wills, and He is the Exalted in Might, the Merciful.

source: وعد الله لا يخلف الله وعده ولكن أكثر الناس لا يعلمون
en: [It is] the promise of Allah. Allah does not fail in His promise, but most of the people do not know.

source: يعلمون ظاهرا من الحياة الدنيا وهم عن الآخرة هم غافلون
en: They know what is apparent of the worldly life, but they, of the Hereafter, are unaware.

source: أولم يتفكروا في أنفسهم ما خلق الله السماوات والأرض وما بينهما إلا بالحق وأجل مسمى وإن كثيرا من الناس بلقاء ربهم لكافرون
en: Do they not contemplate within themselves? Allah has not created the heavens and the earth and what is between them except in truth and for a specified term. And indeed, many of the people, in [the matter of] the meeting with their Lord, are disbelievers.

source: أولم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم كانوا أشد منهم قوة وأثاروا الأرض وعمروها أكثر مما عمروها وجاءتهم رسلهم بالبينات فما كان الله ليظلمهم ولكن كانوا أنفسهم يظلمون
en: Have they not traveled through the earth and observed how was the end of those before them? They were greater than them in power, and they plowed the earth and built it up more than they have built it up, and their messengers came to them with clear evidences. And Allah would not ever have wronged them, but they were wronging themselves.

source: ثم كان عاقبة الذين أساءوا السوأى أن كذبوا بآيات الله وكانوا بها يستهزئون
en: Then the end of those who did evil was the worst [consequence] because they denied the signs of Allah and used to ridicule them.

source: الله يبدأ الخلق ثم يعيده ثم إليه ترجعون
en: Allah begins creation; then He will repeat it; then to Him you will be returned.

source: ويوم تقوم الساعة يبلس المجرمون
en: And the Day the Hour appears the criminals will be in despair.

source: ولم يكن لهم من شركائهم شفعاء وكانوا بشركائهم كافرين
en: And there will not be for them among their [alleged] partners any intercessors, and they will [then] be disbelievers in their partners.

source: ويوم تقوم الساعة يومئذ يتفرقون
en: And the Day the Hour appears - that Day they will become separated.

source: فأما الذين آمنوا وعملوا الصالحات فهم في روضة يحبرون
en: And as for those who had believed and done righteous deeds, they will be in a garden [of Paradise], delighted.

source: وأما الذين كفروا وكذبوا بآياتنا ولقاء الآخرة فأولئك في العذاب محضرون
en: But as for those who disbelieved and denied Our verses and the meeting of the Hereafter, those will be brought into the punishment [to remain].

source: فسبحان الله حين تمسون وحين تصبحون
en: So exalted is Allah when you reach the evening and when you reach the morning.

source: وله الحمد في السماوات والأرض وعشيا وحين تظهرون
en: And to Him is [due all] praise throughout the heavens and the earth. And [exalted is He] at night and when you are at noon.

source: يخرج الحي من الميت ويخرج الميت من الحي ويحيي الأرض بعد موتها وكذلك تخرجون
en: He brings the living out of the dead and brings the dead out of the living and brings to life the earth after its lifelessness. And thus will you be brought out.

source: ومن آياته أن خلقكم من تراب ثم إذا أنتم بشر تنتشرون
en: And of His signs is that He created you from dust; then, suddenly you were human beings dispersing [throughout the earth].

source: ومن آياته أن خلق لكم من أنفسكم أزواجا لتسكنوا إليها وجعل بينكم مودة ورحمة إن في ذلك لآيات لقوم يتفكرون
en: And of His signs is that He created for you from yourselves mates that you may find tranquillity in them; and He placed between you affection and mercy. Indeed in that are signs for a people who give thought.

source: ومن آياته خلق السماوات والأرض واختلاف ألسنتكم وألوانكم إن في ذلك لآيات للعالمين
en: And of His signs is the creation of the heavens and the earth and the diversity of your languages and your colors. Indeed in that are signs for those of knowledge.

source: ومن آياته منامكم بالليل والنهار وابتغاؤكم من فضله إن في ذلك لآيات لقوم يسمعون
en: And of His signs is your sleep by night and day and your seeking of His bounty. Indeed in that are signs for a people who listen.

source: ومن آياته يريكم البرق خوفا وطمعا وينزل من السماء ماء فيحيي به الأرض بعد موتها إن في ذلك لآيات لقوم يعقلون
en: And of His signs is [that] He shows you the lightning [causing] fear and aspiration, and He sends down rain from the sky by which He brings to life the earth after its lifelessness. Indeed in that are signs for a people who use reason.

source: ومن آياته أن تقوم السماء والأرض بأمره ثم إذا دعاكم دعوة من الأرض إذا أنتم تخرجون
en: And of His signs is that the heaven and earth remain by His command. Then when He calls you with a [single] call from the earth, immediately you will come forth.

source: وله من في السماوات والأرض كل له قانتون
en: And to Him belongs whoever is in the heavens and earth. All are to Him devoutly obedient.

source: وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه وله المثل الأعلى في السماوات والأرض وهو العزيز الحكيم
en: And it is He who begins creation; then He repeats it, and that is [even] easier for Him. To Him belongs the highest attribute in the heavens and earth. And He is the Exalted in Might, the Wise.

source: ضرب لكم مثلا من أنفسكم هل لكم من ما ملكت أيمانكم من شركاء في ما رزقناكم فأنتم فيه سواء تخافونهم كخيفتكم أنفسكم كذلك نفصل الآيات لقوم يعقلون
en: He presents to you an example from yourselves. Do you have among those whom your right hands possess any partners in what We have provided for you so that you are equal therein [and] would fear them as your fear of one another [within a partnership]? Thus do We detail the verses for a people who use reason.

source: بل اتبع الذين ظلموا أهواءهم بغير علم فمن يهدي من أضل الله وما لهم من ناصرين
en: But those who wrong follow their [own] desires without knowledge. Then who can guide one whom Allah has sent astray? And for them there are no helpers.

source: فأقم وجهك للدين حنيفا فطرت الله التي فطر الناس عليها لا تبديل لخلق الله ذلك الدين القيم ولكن أكثر الناس لا يعلمون
en: So direct your face toward the religion, inclining to truth. [Adhere to] the fitrah of Allah upon which He has created [all] people. No change should there be in the creation of Allah. That is the correct religion, but most of the people do not know.

source: منيبين إليه واتقوه وأقيموا الصلاة ولا تكونوا من المشركين
en: [Adhere to it], turning in repentance to Him, and fear Him and establish prayer and do not be of those who associate others with Allah

source: من الذين فرقوا دينهم وكانوا شيعا كل حزب بما لديهم فرحون
en: [Or] of those who have divided their religion and become sects, every faction rejoicing in what it has.

source: وإذا مس الناس ضر دعوا ربهم منيبين إليه ثم إذا أذاقهم منه رحمة إذا فريق منهم بربهم يشركون
en: And when adversity touches the people, they call upon their Lord, turning in repentance to Him. Then when He lets them taste mercy from Him, at once a party of them associate others with their Lord,

source: أم أنزلنا عليهم سلطانا فهو يتكلم بما كانوا به يشركون
en: Or have We sent down to them an authority, and it speaks of what they were associating with Him?

source: وإذا أذقنا الناس رحمة فرحوا بها وإن تصبهم سيئة بما قدمت أيديهم إذا هم يقنطون
en: And when We let the people taste mercy, they rejoice therein, but if evil afflicts them for what their hands have put forth, immediately they despair.

source: أولم يروا أن الله يبسط الرزق لمن يشاء ويقدر إن في ذلك لآيات لقوم يؤمنون
en: Do they not see that Allah extends provision for whom He wills and restricts [it]? Indeed, in that are signs for a people who believe.

source: فآت ذا القربى حقه والمسكين وابن السبيل ذلك خير للذين يريدون وجه الله وأولئك هم المفلحون
en: So give the relative his right, as well as the needy and the traveler. That is best for those who desire the countenance of Allah, and it is they who will be the successful.

source: وما آتيتم من ربا ليربو في أموال الناس فلا يربو عند الله وما آتيتم من زكاة تريدون وجه الله فأولئك هم المضعفون
en: And whatever you give for interest to increase within the wealth of people will not increase with Allah. But what you give in zakah, desiring the countenance of Allah - those are the multipliers.

source: الله الذي خلقكم ثم رزقكم ثم يميتكم ثم يحييكم هل من شركائكم من يفعل من ذلكم من شيء سبحانه وتعالى عما يشركون
en: Allah is the one who created you, then provided for you, then will cause you to die, and then will give you life. Are there any of your "partners" who does anything of that? Exalted is He and high above what they associate with Him.

source: ظهر الفساد في البر والبحر بما كسبت أيدي الناس ليذيقهم بعض الذي عملوا لعلهم يرجعون
en: Corruption has appeared throughout the land and sea by [reason of] what the hands of people have earned so He may let them taste part of [the consequence of] what they have done that perhaps they will return [to righteousness].

source: قل سيروا في الأرض فانظروا كيف كان عاقبة الذين من قبل كان أكثرهم مشركين
en: Say, [O Muhammad], "Travel through the land and observe how was the end of those before. Most of them were associators [of others with Allah].

source: فأقم وجهك للدين القيم من قبل أن يأتي يوم لا مرد له من الله يومئذ يصدعون
en: So direct your face toward the correct religion before a Day comes from Allah of which there is no repelling. That Day, they will be divided.

source: من كفر فعليه كفره ومن عمل صالحا فلأنفسهم يمهدون
en: Whoever disbelieves - upon him is [the consequence of] his disbelief. And whoever does righteousness - they are for themselves preparing,

source: ليجزي الذين آمنوا وعملوا الصالحات من فضله إنه لا يحب الكافرين
en: That He may reward those who have believed and done righteous deeds out of His bounty. Indeed, He does not like the disbelievers.

source: ومن آياته أن يرسل الرياح مبشرات وليذيقكم من رحمته ولتجري الفلك بأمره ولتبتغوا من فضله ولعلكم تشكرون
en: And of His signs is that He sends the winds as bringers of good tidings and to let you taste His mercy and so the ships may sail at His command and so you may seek of His bounty, and perhaps you will be grateful.

source: ولقد أرسلنا من قبلك رسلا إلى قومهم فجاءوهم بالبينات فانتقمنا من الذين أجرموا وكان حقا علينا نصر المؤمنين
en: And We have already sent messengers before you to their peoples, and they came to them with clear evidences; then We took retribution from those who committed crimes, and incumbent upon Us was support of the believers.

source: الله الذي يرسل الرياح فتثير سحابا فيبسطه في السماء كيف يشاء ويجعله كسفا فترى الودق يخرج من خلاله فإذا أصاب به من يشاء من عباده إذا هم يستبشرون
en: It is Allah who sends the winds, and they stir the clouds and spread them in the sky however He wills, and He makes them fragments so you see the rain emerge from within them. And when He causes it to fall upon whom He wills of His servants, immediately they rejoice

source: وإن كانوا من قبل أن ينزل عليهم من قبله لمبلسين
en: Although they were, before it was sent down upon them - before that, in despair.

source: فانظر إلى آثار رحمت الله كيف يحيي الأرض بعد موتها إن ذلك لمحيي الموتى وهو على كل شيء قدير
en: So observe the effects of the mercy of Allah - how He gives life to the earth after its lifelessness. Indeed, that [same one] will give life to the dead, and He is over all things competent.

source: ولئن أرسلنا ريحا فرأوه مصفرا لظلوا من بعده يكفرون
en: But if We should send a [bad] wind and they saw [their crops] turned yellow, they would remain thereafter disbelievers.

source: فإنك لا تسمع الموتى ولا تسمع الصم الدعاء إذا ولوا مدبرين
en: So indeed, you will not make the dead hear, nor will you make the deaf hear the call when they turn their backs, retreating.

source: وما أنت بهاد العمي عن ضلالتهم إن تسمع إلا من يؤمن بآياتنا فهم مسلمون
en: And you cannot guide the blind away from their error. You will only make hear those who believe in Our verses so they are Muslims [in submission to Allah].

source: الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة ثم جعل من بعد قوة ضعفا وشيبة يخلق ما يشاء وهو العليم القدير
en: Allah is the one who created you from weakness, then made after weakness strength, then made after strength weakness and white hair. He creates what He wills, and He is the Knowing, the Competent.

source: ويوم تقوم الساعة يقسم المجرمون ما لبثوا غير ساعة كذلك كانوا يؤفكون
en: And the Day the Hour appears the criminals will swear they had remained but an hour. Thus they were deluded.

source: وقال الذين أوتوا العلم والإيمان لقد لبثتم في كتاب الله إلى يوم البعث فهذا يوم البعث ولكنكم كنتم لا تعلمون
en: But those who were given knowledge and faith will say, "You remained the extent of Allah 's decree until the Day of Resurrection, and this is the Day of Resurrection, but you did not used to know."

source: فيومئذ لا ينفع الذين ظلموا معذرتهم ولا هم يستعتبون
en: So that Day, their excuse will not benefit those who wronged, nor will they be asked to appease [Allah].
